# IFCFileWriteOptions Class (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
IFCFileWriteOptions Class
Members See Also
---
This class contains options to write an IFC file.
**Namespace:** Autodesk.Revit.DB.IFC**Assembly:** RevitAPIIFC (in RevitAPIIFC.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2013
# Syntax
C#
---
```text
public class IFCFileWriteOptions : IDisposable
```

Visual Basic
---
```text
Public Class IFCFileWriteOptions _
	Implements IDisposable
```

Visual C++
---
```text
public ref class IFCFileWriteOptions : IDisposable
```

# Inheritance Hierarchy
System..::..Object Autodesk.Revit.DB.IFC..::..IFCFileWriteOptions
# See Also
IFCFileWriteOptions Members
Autodesk.Revit.DB.IFC Namespace